Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: OBS packages binaries into the package format used by the target distribution.
ja: OBS は、バイナリ ファイルをターゲット ディストリビューションで使用されるパッケージ形式にパッケージングします。

source: Surely this testing will turn up ambiguities and shortcomings in the spec, which will be rolled into the release and start the V2.0 agenda.
ja: このテストによって、仕様の曖昧さや欠陥がわかり、リリースに反映されて、バージョン 2.0 の基本方針が決定します。

source: Compliance practices included in the checklist will reduce the risk of compliance failure as well as deliver tangible benefit relative to the cost of those practices.
ja: チェックリストに含まれている成功事例は、コンプライアンス違反のリスクを低減し、大きなメリットをもたらしますが、コストはそれほどかかりません。

source: This allows application developers to directly build and test their work using the latest MeeGo branches.
ja: このため、アプリケーション開発者は、最新の MeeGo ブランチを使用して、自分のプログラムを直接ビルドおよびテストすることができます。

source: If the investigation uncovers a compliance issue, you will report back to the inquirer with the assurance that you will take all the necessary steps needed to bring your product back to compliance while specifying a date by which you expect to complete this task.
ja: 調査によってコンプライアンス問題が露わになった場合は、照会者に対し、対象製品のコンプライアンス実現に必要なすべての手続きをとる旨を確約し、この処理の完了予定日を明言します。

source: - Review and approve content of web portals in relation to compliance
ja: コンプライアンスに関連する Web ポータルのコンテンツのレビューと承認を行う

source: An efficient, automated system includes electronic forms, templates, and workflows.
ja: 効率的な自動システムには、電子フォーム、テンプレート、およびワークフローが含まれています。

source: The OSRB is responsible for responding to compliance inquiries received by the company in relation to FOSS compliance.
ja: OSRB は、企業が受け付けた FOSS コンプライアンスに関する照会に対応する責任を負います。

source: License changes can occur between version upgrades.
ja: バージョンのアップグレードで、ライセンスの変更が発生する場合もあります。

source: Therefore, it is important for companies to update their supply chain procedures (and deal flow process) to address the acquisition and use of FOSS to give them visibility into what FOSS is delivered to them by their software providers.
ja: したがって、 企業は、FOSS の入手や使用に対処するためのサプライ チェーン手続き (および取引の流れ) を更新し、ソフトウェア提供者がどのような FOSS を自社に配布しているかを可視化することが重要です。

source: The recommended practices map directly to the steps illustrated in the compliance process.
ja: 推奨プラクティスは、このコンプライアンス プロセスの図で説明している各ステップに対応しています。

source: Implement a policy in the compliance management system that does not allow a compliance ticket to be closed if it has open sub-tasks or open issues.
ja: コンプライアンス管理システムにポリシーを実装し、オープン サブタスク、またはオープン イシューがある場合は、コンプライアンス チケットをクローズできないようにする。

source: Working together comes at ease with OBS's project model and a complete infrastructure that relieves developers from setting up their own "compiler farms" for building for different architectures and multiple Linux distributions.
ja: OBS のプロジェクト モデルと完成された開発基盤により、協力的作業が簡単に実現できます。異なるアーキテクチャや複数の Linux ディストリビューションをビルドするために、開発者が自分で「コンパイル ファーム」を準備する必要はありません。

source: Key practices and capabilities in this area include the following:
ja: この分野の主なプラクティスと機能には、次のようなものがあります。

source: Bottom-up or Top-Down Distribution Creation
ja: ボトムアップやトップダウンによるディストリビューション作成

source: Data to collect on intended use
ja: 利用にあたって収集するべきデータ

source: The Dependency Checker Tool
ja: 依存状態チェッカー ツール (Dependency Checker Tool)

source: “Managing FOSS Compliance in the Enterprise”
ja: 『企業における FOSS コンプライアンス管理』

source: What started as automation tasks eventually evolved into workflow management and build automation and management solutions, whether commercial or open-source, are now providing developers, workgroups and entire organizations with the necessary power and flexibility to manage even the most complex software build processes.
ja: 自動化タスクとして開始されたものが、商用やオープン ソースのワークフロー管理/ビルド自動化/管理ソリューションに成長し、現在では、開発者やワークグループや組織全体に、極めて複雑なソフトウェア ビルド プロセスを管理できるパワーと柔軟性を提供しています。

source: A statement regarding what license this code is under
ja: このコードのライセンスを示す文言

source: - An audit is requested to scan the source code
ja: ソース コードをスキャンするための監査要求が出される

source: Once FOSS packages are uploaded to the distribution web site, there are some recommended post distribution verification steps, including for instance:
ja: FOSS パッケージをディストリビューション Web サイトにアップロードしたら、以下のような「配布後検証」作業を行ってください。

source: The internal portal houses the compliance policies, guidelines, documentation, training, and may also host forums for discussions, announcements and provide access to mailing lists.
ja: 社内ポータルには、コンプライアンス ポリシー、ガイドライン、ドキュメンテーション、トレーニングなどが保存され、ディスカッション フォーラムの運営、アナウンスメント、メーリング リストへのアクセス提供などが行われます。

source: - Escalates compliance issues to OSEC
ja: コンプライアンスに関する問題を OSEC に上申する

source: SPDX(TM) includes the possibility of a multi-person ‘signoff/reviewed by’ process
ja: 複数の人物による「サインオフ/レビュー」プロセスの可能性

source: We will then introduce the Open Build Service (OBS) and its architecture.
ja: 続いて、Open Build Service (OBS) とそのアーキテクチャについて説明します。

source: In addition, companies using FOSS in commercial products, while complying with the terms of FOSS licenses, want to protect their intellectual property and that of 3rd party suppliers from unintended disclosure.
ja: さらに、商用製品で FOSS を使用している企業は、FOSS のライセンス条件を順守しつつ、企業の知的財産とサード パーティ サプライヤー の知的財産の意図せざる開示を防ぐ必要があります。

source: Many times, open source developers need to contact companies to discuss compliance issues but cannot find the appropriate party.
ja: オープン ソース開発者は、コンプライアンスの問題について常に会社に相談する必要がありますが、適切な相談相手はなかなか見つからないものです。

source: Ability to perform (availability of skilled staffing, resources, and funding)
ja: 履行能力 (スキルある人材、リソース、資金)

source: Whether to require codescans
ja: コード スキャンは必要か

source: Individuals charged with managing business processes have received training in OSS compliance requirements and exhibit sensitivity to OSS compliance concerns.
ja: ビジネス プロセス管理の責任者は、OSS コンプライアンス要件に関する教育を受けており、OSS コンプライアンスの検討事項について充分配慮すること。

source: Tool
ja: ツール

source: Educational programs and training
ja: 教育的プログラムとトレーニング

source: - Knowledge of industry practices (FOSS compliance and FOSS development model)
ja: 業界の慣行 (FOSS コンプライアンスおよび FOSS 開発モデル) に関する知識

source: Scope is one problem: from the Free Beer license to the GPL family of licenses to platform-specific licenses such as Apache and Eclipse, the sheer number and variety of licenses makes it difficult for companies to ”do the right thing” with respect to the software components in their products and applications.
ja: Free Beer ライセンスから、GPL 系のライセンス、あるいは Apache や Eclipse のようなプラットフォーム別のライセンスまで、膨大な数と種類のライセンスがあるため、企業が自社の製品やアプリケーションに含まれているソフトウェア コンポーネントについて、「正しい行動をとる」ことが難しくなっています。

source: Build systems capable of meeting the demands of increasingly complex software systems and expanding organizations require an initial as well as continuous investment of the organization looking to deploy them.
ja: 複雑化を増すソフトウェア システムや拡大する組織の需要に対応できるビルド システムにするには、組織が終始一貫して、そのデプロイメントに配慮して投資する必要があります。

source: OPEN COMPLIANCE PROGRAM
ja: オープン コンプライアンス プログラム

source: For instance BoM_v1.0 represents version 1.0 and BoM_v1.1 represents version 1.1.
ja: たとえば、BoM_v1.0 はバージョン 1.0 を、BoM_v1.1 はバージョン 1.1 を表します。

source: Web Presence
ja: Web プレゼンス

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA
ja: あなたは、このプログラムとともに GNU General Public License のコピーを受け取っている必要があります。もしなければ、 Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA までお知らせください。

source: MeeGo is designed for cross-device, cross-architecture computing and is built from the ground up, for a new class of powerful computing devices.
ja: MeeGo は、クロスデバイス、クロスアーキテクチャを目指して設計され、新しいタイプの強力なコンピューター機器のために、ゼロから構築されました。

source: Components that are third party licensed under a commercial license
ja: 商用ライセンスのもとでライセンスされているサード パーティのコンポーネント

source: The Linux Foundation can also use this list for rapid alerts of changing legal landscapes and to coordinate actions in the community and industry.
ja: また The Linux Foundation では、このリストを使用して、法務的な変更を速やかに通知したり、コミュニティや業界の活動を調整したりします。

source: As a result, the risks that companies used to manage through license negotiations are now managed through compliance and engineering practices.
ja: その結果、企業がかつてライセンス交渉を介して管理していたリスクは、今はコンプライアンスとエンジニアリング プラクティスによって管理されています。

source: Conduct source code inspections before releasing the source code.
ja: ソース コードをリリースする前にソース コード点検を実行する。

source: - Coordinates the source code distribution of FOSS packages with engineering and product team, including preparing and verifying distribution checklist for each FOSS package
ja: エンジニアリング/プロダクト チームとともに、各 FOSS パッケージの配布チェックリストの準備や検証などを行い、 FOSS パッケージのソース コード配布作業を調整する

source: LinuxCon, The Linux Foundation’s premier US conference, offers several embedded sessions.
ja: LinuxCon は、The Linux Foundation による最大の US カンファレンスであり、さまざまな組込みセッションが提供されます。

source: Open Compliance Directory and Rapid Alert System
ja: オープン コンプライアンス ディレクトリと緊急警報システム

source: The minimum set of information reported should include:
ja: 報告には、少なくとも以下の情報が含まれている必要があります。

source: - A proper compliance record (also called ticket) is created capturing all necessary information about the usage of that specific FOSS and providing the location of the source code within the internal build system.
ja: コンプライアンス記録 (チケットとも呼ばれる) が作成され、対象の FOSS を使用する際に必要なすべての情報、およびビルド システム内のソース コードの場所が捕捉される。

source: Adaptation of Business Processes focuses on fitting OSS compliance concerns within the context of existing business processes.
ja: 「ビジネス プロセスの適応」は、既存のビジネス プロセスの文脈に、OSS コンプライアンスの諸事項をうまく組み込むことに焦点を当てます。

source: - Verifications of all the steps in the process
ja: プロセスのすべてのステップが検証されていること

source: Process management assures that OSS compliance activities are included early enough in the product development cycle to enable the organization to meet its release timelines.
ja: プロセス管理者は、OSS コンプライアンス作業を製品開発サイクルの早期段階に組み入れ、組織が製品のリリース タイムラインを守れるよう保証する。

source: Maintaining compliance is a continuous effort and is a comparatively small incremental effort that depends on discipline and commitment to build compliance activities into existing engineering and business processes.
ja: コンプライアンスの維持は、継続的な取り組みであり、比較的小さな処理の積み重ねですが、コンプライアンス活動を既存の技術プロセスやビジネス プロセスに組み込むための規則や義務によって多少異なります。

source: For Developers
ja: 開発者向け

source: Company to make available the complete and corresponding source code used in their product freely available on its website
ja: 企業は、製品に使用したすべての対応するソース コードを企業の Web サイトで公開する

source: FSFE Guide to Reporting and Fixing License Violations
ja: ライセンス違反の報告および修正に関する FSFE のガイド (英語)

source: OBS is an open distribution development and deployment platform supporting use cases from the perspectives of users, software developers, distributors and independent software vendors (ISVs).
ja: OBS は、ユーザー、ソフトウェア開発者、ディストリビューター、および独立系ソフトウェア ベンダー (ISVs) 向けのユース ケースをサポートするオープンなディストリビューション開発/展開プラットフォームです。

source: Examples of pre-distribution verifications include:
ja: 配布前の検証ステップには、以下のような作業が含まれます。

source: All files submitted are scanned, including binary files.
ja: 供されたすべてのファイルは、バイナリ ファイルも残らずスキャンされます。

source: Suppliers themselves should welcome a single standard format for disclosing open source rather than having to respond to each manufacturer’s request using a unique format.
ja: サプライヤーは、独自のフォーマットを使用する各メーカーの要求に応えるより、オープン ソース開示用の標準フォーマットを使えるほうがよいでしょう。

source: Thanks for reading and stay tuned for more publications on the topic of FOSS compliance!
ja: ご精読ありがとうございました。FOSS コンプライアンスに関する他の資料も、ぜひご覧ください。

source: 3rd party commercial, developed by 3rd party software providers and received by the company building the product under a commercial license
ja: サード パーティ商用: サード パーティのソフトウェア提供者が開発し、その製品の製造元が商用ライセンスの下で入手したコード

source: Once you kick off these activities (in that order) and you have a good grip on the build system (from a compliance perspective), you can move to the other program elements.
ja: 一度これらの活動をこの順序で開始し、そのビルド システムをコンプライアンスの観点からよく把握できれば、他のプログラム要素に展開することができます。

source: Code Janitor Tool
ja: コード管理ツール (Code Janitor Tool)

source: In this step of the compliance due diligence, the OSRB Chair prepares the notices and passes them to the appropriate departments for fulfillment (Figure 10).
ja: コンプライアンス精査の中のこのステップでは、OSRB チェアが告知文を準備し、それを各担当部署に手渡します (図 10)。

source: Conferences offer classes that work hands-on with embedded Linux, like the popular BYOES classes at ESC.
ja: いろいろなカンファレンスでも、たとえば ESC (Embedded Systems Conference) の BYOES (Build Your Own Embedded System) のような組込み Linux 実習クラスを提供しています。

source: Two Hours
ja: 2 時間

source: The tool identifies a linkage conflict between binaries and libraries based on license policies defined in advance by the user of the tool .
ja: このツールは、ツールの使用者が事前に定義したライセンス ポリシーに基づいて、バイナリとライブラリー間のリンクの矛盾を識別します。

source: Documentation
ja: ドキュメンテーション

source: FOSSology (http://fossology.org) is an open source compliance toolset that provides license and copyright discovery.
ja: FOSSology (http://fossology.org) は、ライセンスと著作権情報を検出できるオープン ソース コンプライアンス ツールセットです。

source: Every file submitted to the FOSSology system is saved in a file repository, scanned, and results are stored in a database.
ja: FOSSology システムに供されるすべてのファイルは、ファイル リポジトリに保存されてスキャンされ、その結果がデータベースに登録されます。

source: Implementing and running a bill of materials5 (BoM) difference tool6 to identify source code modifications at product level and component level.
ja: BoM (構成リスト) 比較ツールを実行し、製品レベルとコンポーネント レベルでソース コードの修正状況を識別する。

source: b) The organization assigns adequate resources to achieve closure in a reasonable timeframe.
ja: b) 組織は、合理的な期間内で解決するために、適切なリソースを割り当てる。

source: Unique identifier
ja: 一意の識別子

source: From the FOSSology server
ja: FOSSology サーバーから

source: What types of software activity require explicit compliance efforts
ja: コンプライアンス作業を必要とするソフトウェア活動にはどんなものがあるか

source: Commercial products are distributed under an end user license agreement.
ja: すべての商品は、エンドユーザー ライセンス同意書の下で配布されます。

source: Deployment ?
ja: デプロイメント

source: Metrics are defined and collected to assess the effectiveness of the organization's OSS use and its OSS compliance activities.
ja: 組織の OSS 利用の効果、および OSS コンプライアンス作業を評価するためにメトリクスが定義され、収集されている。◆◆

source: Feedback and Future Revisions
ja: フィードバックと今後の改訂

source: To learn more, request more information, or to register for open compliance training, please visit http://www.linuxfoundation.org/programs/legal/compliance/training-and-education.
ja: 詳細情報について、またはオープン コンプライアンス トレーニングの登録については、下記のページを参照してください。 http://www.linuxfoundation.org/programs/legal/compliance/training-and-education

source: This page highlights compliance tools developed by or sponsored by The Linux Foundation and encourages community involvement in the tools' evolution.
ja: このページでは、The Linux Foundation が開発または支援するコンプライアンス ツールを取り上げ、これらのツールがさらに進化するよう、コミュニティに呼びかけています。

source: Acknowledgment
ja: 謝辞

source: FMEA Failure Mode Effects Analysis
ja: FMEA Failure Mode Effects Analysis (失敗モード影響分析)

source: Often it is easy to forget sub-tasks or pending sub-issues, which may led to prematuring closing a compliance ticket even though open issues remain.
ja: サブタスクを忘れたり、問題をペンディング状態で残すことはありがちですが、オープン イシューを残したまま、コンプライアンス チケットをクローズしてはいけません。

source: There is no code clone detection.
ja: コード クローン検出機能がない。

source: Resolving any identified issues as part of the scan and audit activity
ja: スキャンおよび監査活動で検出されたすべての問題を解決する

source: It is, at the time of writing, running version 2.1.1 serving over 880 users building more than 1700 projects of which about 1150 are user projects and the remainder are MeeGo development branches.
ja: このホワイトペーパーを書いている時点では、バージョン 2.1.1 が 1,700 件を超えるプロジェクトをビルドする 880 ユーザー以上に利用されています。これらのプロジェクトのうち、約 1,150 件はユーザー プロジェクトであり、残りは MeeGo 開発ブランチです。

source: However, in the absence of a trust model, there has to be a way of allowing easy external media boot when the KEK or signature of the external media image isn’t necessarily present in the signature database.
ja: しかし、信頼モデルが存在しない場合は、外部メディア イメージの鍵交換鍵や署名が署名データベースに存在しないときに、外部メディアから簡単にブートできる方法が必要です。

source: Identification of FOSS
ja: FOSS の識別

source: Relationships with the FOSS projects and FOSS organizations
ja: FOSS プロジェクトや FOSS 組織との関係

source: Still other licenses require source code offers for the covered open source and any code combined with it.
ja: さらに、含まれているオープン ソースと、それに結合されたすべてのコードのソース コードを提供するよう求めるライセンスもあります。

source: Continuous Integration ?
ja: 継続的な統合

source: Mandate architecture reviews and code inspections to understand how software componentsare inter-related and to discover license obligations that can propagate from FOSS to proprietary software.
ja: ソフトウェア コンポーネントの相互関係を理解し、FOSS からプロプライエタリ ソフトウェアに伝播しているライセンス義務を発見するために、アーキテクチャ レビューとコード検査を義務付ける。

source: The organization subjects all open source use in products to review and defines what contextual changes in OSS use trigger re-approval activity.
ja: 組織は、製品内のすべてのオープン ソース使用に調査を義務付け、さらに、OSS 使用に関してどのような変更があると再承認処理が必要になるかを定義すること。◆

source: The goal of this review is to identify:
ja: このレビューの目的は、次の項目を明らかにすることです。

source: The MeeGo project is the open source software platform for the next generation of computing devices.
ja: MeeGo プロジェクトは、次世代コンピューティング デバイスのためのオープン ソース ソフトウェア プラットフォームです。

source: Methods to identify and audit incoming FOSS
ja: 流入する FOSS を識別および監査する方法

source: Acknowledgements
ja: 謝辞

source: The repository server provides an HTTP interface through which it accepts requests.
ja: リポジトリ サーバーは、リクエストを承認するための HTTP インタフェースを提供します。

source: - Accessible for download for the public
ja: 公にダウンロードが可能であること

source: The business environment is not as predictable as in a purely commercial environment
ja: 純粋に商業的な環境と比べると、ビジネス環境を予測できない

source: Instead, they should acknowledge the receipt of the inquiry, inform the reporter that they will be looking into it and provide a certain date on when to expect a follow-up.
ja: 照会があったことを確認し、これから調査することを照会者に伝え、明確な回答予定日を提示する必要があります。

source: Compile Step
ja: コンパイル ステップ

source: Discovery of open sourceinclusion: audits and code scans
ja: 組み込まれているオープン ソースの検出: 監査とコード スキャン

source: Please consider this paper as an invitation to participate.
ja: ぜひこの機会に FOSSology の活動に参加してください。

source: b)A web portal or other face to the community is created to provide online access to source code used in company products.
ja: b) コミュニティ向けに Web ポータルなどの窓口を作成し、自社製品で使用されているソース コードへのオンライン アクセスを提供する。

source: I use the term “due diligence” to refer to a number of concepts involving either the performance of source inspection or source surveillance, or the performance of quality duties or system audits.
ja: このホワイト ペーパーでは、「精査 (due diligence)」という語を使っていますが、これは、ソース コードの検査や監視、品質義務やシステム監査などの一連の作業を指しています。

source: - Contribute to improving the compliance program
ja: コンプライアンス プログラムの改良に貢献する

source: - Solid understanding of FOSS licenses and obligations to discuss with legal counsels
ja: 法律顧問と議論するために必要な、FOSS ライセンスとその義務に関する確かな理解

source: Formal Name
ja: 正式名

source: Access to these tools is provided at
ja: これらのツールは、下記のページからダウンロードできます。

source: How to participate in FOSSology development?
ja: FOSSology の開発に参加するには

source: As a rule of thumb, each time developers modify a previously approved component or plan to use a previously approved component in a different product, the source code of the component should be re-scanned and the component should go through the approval process again.
ja: つまり、開発者が既承認コンポーネントを改変する場合や、別の製品に使用する場合は、そのコンポーネントのソース コードをスキャンし直し、もう一度承認プロセスまでの手続きを踏む必要があります。

source: Woe to the developer who snags a bit of code after a simple web search without understanding the ramifications of license restrictions.
ja: ライセンスの制約の問題を理解しないまま、単純な Web 検索でコードを取得する開発者が存在するのは、本当に困ったことです。

source: The goal of this step is to monitor the intake and incorporation of FOSS in the product either as a standalone package or embedded within third party or company-developed proprietary software.
ja: このステップの目的は、単体のパッケージ製品に含まれている FOSS、およびサード パーティや自社開発のプロプライエタリ ソフトウェアに組み込まれた FOSS の使用/組み込みを監視することです。

source: Workers
ja: ワーカー

source: We need participation and support from key Linux distros and package maintainers, tool developers (commercial and open source) and package consuming organizations as well.
ja: 主要な Linux ディストリビューターやパッケージ メンテナー、(商用およびオープン ソースの) ツール開発者、さらにはパッケージの利用者側の組織による参加と支援が必要です。

source: The OSRB usage form provides information regarding the open source project and describes the intended use of the FOSS in question and helps construct and maintain a good record of software origin.
ja: OSRB に提出される使用申請書は、オープン ソース プロジェクトに関する情報を提供し、該当する FOSS の用途を説明し、さらにソフトウェアの由来について正しい記録を作成および保持するのに役立ちます。

source: Commercialization
ja: 商品化

source: Supply chain personnel should mandate that all source code received from outsourced development centers must go through the compliance process to discover all FOSS being used and ensure proper actions to fulfill license obligations.
ja: サプライ チェーン担当者は、外注開発センターから受け取るすべてのソース コードにコンプライアンス プロセスを適用して、使用しているすべての FOSS を検出し、適切な処理を施してライセンス義務の順守を徹底するよう命じます。

source: Download Open Compliance Training Data Sheet
ja: オープン コンプライアンス トレーニング データ シートをダウンロードする

source: Given the explosive adoption of Linux in the mobile, consumer electronics and embedded industries, the time is right to proactively offer tools and services that will help the industry self-govern its use of open source.
ja: LF では、モバイル、家電、および組込み業界において、今後 Linux が爆発的に導入されることを想定し、その事前対策として、各業界がオープン ソースの使用を自己統治できるようなツールやサービスを提供します。

source: A recommended practice is to perform dynamic and static linkage analysis for every binary in the build system.
ja: 推奨プラクティスは、ビルド システム内の全バイナリに対する動的および静的リンク解析の実行です。

source: How can you help your company be ahead of the curve on FOSS compliance?
ja: どうすれば、あなたの会社は FOSS コンプライアンスにおいて先行できるでしょうか。

source: even a single one ?
ja: たとえ 1 つであっても

source: Training options include:
ja: オプションのトレーニング:

source: Integrate Compliance in the Development Process
ja: 開発プロセスにコンプライアンスを統合する

source: Overall responsibility for achieving organization-wide OSS compliance is clearly designated.
ja: 組織全体にわたり、OSS コンプライアンスを履行するすべての責任について、明確に指定すること。

source: The Linux Foundation now offers the industry’s more comprehensive compliance resource for training and informational materials.
ja: The Linux Foundation は、トレーニングや情報資料として、その業界の包括的なコンプライアンス リソースを提供します。

source: Once a software component has been approved for usage in a product, its compliance ticket will be updated to reflect the approval and it will be added to the software inventory that tracks FOSS used in products (Figure 9).
ja: 対象のソフトウェア コンポーネントを製品に使用することが承認されると、承認の事実がコンプライアンス チケットに反映され、ソフトウェア インベントリに追加されます。ソフトウェア インベントリでは、製品で使用する FOSS に状況が記録されていきます (図 9)。

source: Auditing source code as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「ソース コードの監査」ステップ

source: The MeeGo project leverages the strengths of the Open Build Service (OBS) for distribution and application development.
ja: MeeGo プロジェクトは、ディストリビューションやアプリケーションを開発するために Open Build Service (OBS) の強みを利用しています。

source: Responding to complianceinquiries
ja: コンプライアンスに関する照会への対応

source: The goal of providing FOSS and compliance training is to raise awareness of FOSS policies and strategies and to build a common understanding around the issues and facts of FOSS licensing.
ja: FOSS とコンプライアンス トレーニングを提供する目的は、FOSS のポリシーと戦略に対する認識を高め、FOSS のライセンスの問題や事実に関する一般的理解を深めることです。

source: A checklist of recommended practices should prompt companies to assess the extent to which they’ve institutionalized compliance actions and the degree to which those actions produce needed business results.
ja: 企業は、推奨事例によるチェックリストを使用することで、コンプライアンス活動をどの程度組織化したか、そして、求めていたビジネス成果はコンプライアンス活動によってどの程度達成されたかを自己評価できます。

source: e)If determined to be necessary, efforts to re-write copyrighted code as proprietary software under cleanroom conditions are carried out according to a defined procedure.
ja: e) 必要と判断した場合は、定義された手順に従い、著作権のあるコードをプロプライエタリ ソフトウェアとしてクリーンルーム方式で修正する試みが実行されること。
